tinko26/ao/src/ao_sys_xc32_pic32/ao_can_3.h
#ifndef AO_CAN_FILTER_FIFO_3_12

#define AO_CAN_FILTER_FIFO_3_12         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_12

#define AO_CAN_FILTER_IDE_3_12          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_12

#define AO_CAN_FILTER_MASK_3_12         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_12

#define AO_CAN_FILTER_SID_3_12          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_13

#define AO_CAN_FILTER_EID_3_13          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_13

#define AO_CAN_FILTER_ENABLE_3_13       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_13

#define AO_CAN_FILTER_FIFO_3_13         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_13

#define AO_CAN_FILTER_IDE_3_13          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_13

#define AO_CAN_FILTER_MASK_3_13         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_13

#define AO_CAN_FILTER_SID_3_13          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_14

#define AO_CAN_FILTER_EID_3_14          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_14

#define AO_CAN_FILTER_ENABLE_3_14       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_14

#define AO_CAN_FILTER_FIFO_3_14         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_14

#define AO_CAN_FILTER_IDE_3_14          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_14

#define AO_CAN_FILTER_MASK_3_14         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_14

#define AO_CAN_FILTER_SID_3_14          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_15

#define AO_CAN_FILTER_EID_3_15          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_15

#define AO_CAN_FILTER_ENABLE_3_15       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_15

#define AO_CAN_FILTER_FIFO_3_15         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_15

#define AO_CAN_FILTER_IDE_3_15          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_15

#define AO_CAN_FILTER_MASK_3_15         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_15

#define AO_CAN_FILTER_SID_3_15          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_16

#define AO_CAN_FILTER_EID_3_16          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_16

#define AO_CAN_FILTER_ENABLE_3_16       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_16

#define AO_CAN_FILTER_FIFO_3_16         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_16

#define AO_CAN_FILTER_IDE_3_16          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_16

#define AO_CAN_FILTER_MASK_3_16         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_16

#define AO_CAN_FILTER_SID_3_16          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_17

#define AO_CAN_FILTER_EID_3_17          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_17

#define AO_CAN_FILTER_ENABLE_3_17       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_17

#define AO_CAN_FILTER_FIFO_3_17         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_17

#define AO_CAN_FILTER_IDE_3_17          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_17

#define AO_CAN_FILTER_MASK_3_17         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_17

#define AO_CAN_FILTER_SID_3_17          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_18

#define AO_CAN_FILTER_EID_3_18          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_18

#define AO_CAN_FILTER_ENABLE_3_18       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_18

#define AO_CAN_FILTER_FIFO_3_18         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_18

#define AO_CAN_FILTER_IDE_3_18          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_18

#define AO_CAN_FILTER_MASK_3_18         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_18

#define AO_CAN_FILTER_SID_3_18          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_19

#define AO_CAN_FILTER_EID_3_19          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_19

#define AO_CAN_FILTER_ENABLE_3_19       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_19

#define AO_CAN_FILTER_FIFO_3_19         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_19

#define AO_CAN_FILTER_IDE_3_19          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_19

#define AO_CAN_FILTER_MASK_3_19         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_19

#define AO_CAN_FILTER_SID_3_19          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_20

#define AO_CAN_FILTER_EID_3_20          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_20

#define AO_CAN_FILTER_ENABLE_3_20       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_20

#define AO_CAN_FILTER_FIFO_3_20         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_20

#define AO_CAN_FILTER_IDE_3_20          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_20

#define AO_CAN_FILTER_MASK_3_20         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_20

#define AO_CAN_FILTER_SID_3_20          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_21

#define AO_CAN_FILTER_EID_3_21          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_21

#define AO_CAN_FILTER_ENABLE_3_21       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_21

#define AO_CAN_FILTER_FIFO_3_21         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_21

#define AO_CAN_FILTER_IDE_3_21          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_21

#define AO_CAN_FILTER_MASK_3_21         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_21

#define AO_CAN_FILTER_SID_3_21          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_22

#define AO_CAN_FILTER_EID_3_22          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_22

#define AO_CAN_FILTER_ENABLE_3_22       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_22

#define AO_CAN_FILTER_FIFO_3_22         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_22

#define AO_CAN_FILTER_IDE_3_22          (0)

#endif

