tinko26/ao/src/ao_sys_xc32_pic32/ao_can_3.h
#ifndef AO_CAN_FILTER_MASK_3_22

#define AO_CAN_FILTER_MASK_3_22         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_22

#define AO_CAN_FILTER_SID_3_22          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_23

#define AO_CAN_FILTER_EID_3_23          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_23

#define AO_CAN_FILTER_ENABLE_3_23       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_23

#define AO_CAN_FILTER_FIFO_3_23         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_23

#define AO_CAN_FILTER_IDE_3_23          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_23

#define AO_CAN_FILTER_MASK_3_23         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_23

#define AO_CAN_FILTER_SID_3_23          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_24

#define AO_CAN_FILTER_EID_3_24          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_24

#define AO_CAN_FILTER_ENABLE_3_24       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_24

#define AO_CAN_FILTER_FIFO_3_24         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_24

#define AO_CAN_FILTER_IDE_3_24          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_24

#define AO_CAN_FILTER_MASK_3_24         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_24

#define AO_CAN_FILTER_SID_3_24          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_25

#define AO_CAN_FILTER_EID_3_25          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_25

#define AO_CAN_FILTER_ENABLE_3_25       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_25

#define AO_CAN_FILTER_FIFO_3_25         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_25

#define AO_CAN_FILTER_IDE_3_25          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_25

#define AO_CAN_FILTER_MASK_3_25         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_25

#define AO_CAN_FILTER_SID_3_25          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_26

#define AO_CAN_FILTER_EID_3_26          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_26

#define AO_CAN_FILTER_ENABLE_3_26       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_26

#define AO_CAN_FILTER_FIFO_3_26         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_26

#define AO_CAN_FILTER_IDE_3_26          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_26

#define AO_CAN_FILTER_MASK_3_26         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_26

#define AO_CAN_FILTER_SID_3_26          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_27

#define AO_CAN_FILTER_EID_3_27          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_27

#define AO_CAN_FILTER_ENABLE_3_27       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_27

#define AO_CAN_FILTER_FIFO_3_27         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_27

#define AO_CAN_FILTER_IDE_3_27          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_27

#define AO_CAN_FILTER_MASK_3_27         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_27

#define AO_CAN_FILTER_SID_3_27          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_28

#define AO_CAN_FILTER_EID_3_28          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_28

#define AO_CAN_FILTER_ENABLE_3_28       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_28

#define AO_CAN_FILTER_FIFO_3_28         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_28

#define AO_CAN_FILTER_IDE_3_28          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_28

#define AO_CAN_FILTER_MASK_3_28         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_28

#define AO_CAN_FILTER_SID_3_28          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_29

#define AO_CAN_FILTER_EID_3_29          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_29

#define AO_CAN_FILTER_ENABLE_3_29       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_29

#define AO_CAN_FILTER_FIFO_3_29         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_29

#define AO_CAN_FILTER_IDE_3_29          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_29

#define AO_CAN_FILTER_MASK_3_29         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_29

#define AO_CAN_FILTER_SID_3_29          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_30

#define AO_CAN_FILTER_EID_3_30          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_30

#define AO_CAN_FILTER_ENABLE_3_30       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_30

#define AO_CAN_FILTER_FIFO_3_30         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_30

#define AO_CAN_FILTER_IDE_3_30          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_30

#define AO_CAN_FILTER_MASK_3_30         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_30

#define AO_CAN_FILTER_SID_3_30          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_3_31

#define AO_CAN_FILTER_EID_3_31          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_3_31

#define AO_CAN_FILTER_ENABLE_3_31       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_3_31

#define AO_CAN_FILTER_FIFO_3_31         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_3_31

#define AO_CAN_FILTER_IDE_3_31          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_3_31

#define AO_CAN_FILTER_MASK_3_31         (0)

#endif

#ifndef AO_CAN_FILTER_SID_3_31

#define AO_CAN_FILTER_SID_3_31          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_3_0

#define AO_CAN_FILTER_MASK_EID_3_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_3_0

#define AO_CAN_FILTER_MASK_IDE_3_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_3_0

#define AO_CAN_FILTER_MASK_SID_3_0      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_3_1

#define AO_CAN_FILTER_MASK_EID_3_1      (0)

#endif

