tinko26/ao/src/ao_sys_xc32_pic32/ao_can_3.h
#ifndef AO_CAN_FILTER_MASK_IDE_3_1

#define AO_CAN_FILTER_MASK_IDE_3_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_3_1

#define AO_CAN_FILTER_MASK_SID_3_1      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_3_2

#define AO_CAN_FILTER_MASK_EID_3_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_3_2

#define AO_CAN_FILTER_MASK_IDE_3_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_3_2

#define AO_CAN_FILTER_MASK_SID_3_2      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_3_3

#define AO_CAN_FILTER_MASK_EID_3_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_3_3

#define AO_CAN_FILTER_MASK_IDE_3_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_3_3

#define AO_CAN_FILTER_MASK_SID_3_3      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_INVALID_3

#define AO_CAN_INVALID_3                (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_MODE_3

#define AO_CAN_MODE_3                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_OVERFLOW_3

#define AO_CAN_OVERFLOW_3               (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SENT_3

#define AO_CAN_SENT_3                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SYSTEM_3

#define AO_CAN_SYSTEM_3                 (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TIMER_3

#define AO_CAN_TIMER_3                  (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_UNDERFLOW_3

#define AO_CAN_UNDERFLOW_3              (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_WAKE_UP_3

#define AO_CAN_WAKE_UP_3                (false)

#endif

// ----------------------------------------------------------------------------

// Constants.

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BAUD_MAX_3

#define AO_CAN_BAUD_MAX_3               AO_CAN_BAUD_MAX(AO_SYS_CLOCK_CAN3)

#endif

#ifndef AO_CAN_BAUD_MIN_3

#define AO_CAN_BAUD_MIN_3               AO_CAN_BAUD_MIN(AO_SYS_CLOCK_CAN3)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_BUFFERS_3

#define AO_CAN_BUFFERS_3                                                    \
(                                                                           \
        (AO_CAN_BUFFERS_3_0)  +                                             \
        (AO_CAN_BUFFERS_3_1)  +                                             \
        (AO_CAN_BUFFERS_3_2)  +                                             \
        (AO_CAN_BUFFERS_3_3)  +                                             \
        (AO_CAN_BUFFERS_3_4)  +                                             \
        (AO_CAN_BUFFERS_3_5)  +                                             \
        (AO_CAN_BUFFERS_3_6)  +                                             \
        (AO_CAN_BUFFERS_3_7)  +                                             \
        (AO_CAN_BUFFERS_3_8)  +                                             \
        (AO_CAN_BUFFERS_3_9)  +                                             \
        (AO_CAN_BUFFERS_3_10) +                                             \
        (AO_CAN_BUFFERS_3_11) +                                             \
        (AO_CAN_BUFFERS_3_12) +                                             \
        (AO_CAN_BUFFERS_3_13) +                                             \
        (AO_CAN_BUFFERS_3_14) +                                             \
        (AO_CAN_BUFFERS_3_15) +                                             \
        (AO_CAN_BUFFERS_3_16) +                                             \
        (AO_CAN_BUFFERS_3_17) +                                             \
        (AO_CAN_BUFFERS_3_18) +                                             \
        (AO_CAN_BUFFERS_3_19) +                                             \
        (AO_CAN_BUFFERS_3_20) +                                             \
        (AO_CAN_BUFFERS_3_21) +                                             \
        (AO_CAN_BUFFERS_3_22) +                                             \
        (AO_CAN_BUFFERS_3_23) +                                             \
        (AO_CAN_BUFFERS_3_24) +                                             \
        (AO_CAN_BUFFERS_3_25) +                                             \
        (AO_CAN_BUFFERS_3_26) +                                             \
        (AO_CAN_BUFFERS_3_27) +                                             \
        (AO_CAN_BUFFERS_3_28) +                                             \
        (AO_CAN_BUFFERS_3_29) +                                             \
        (AO_CAN_BUFFERS_3_30) +                                             \
        (AO_CAN_BUFFERS_3_31)                                               \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FIFOS_3

#define AO_CAN_FIFOS_3                                                      \
(                                                                           \
        (AO_CAN_FIFOS_RX_3) +                                               \
        (AO_CAN_FIFOS_TX_3)                                                 \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_RX_3

#define AO_CAN_RX_3                                                         \
(                                                                           \
        (AO_CAN_FIFOS_RX_3) > 0                                             \
        ? true                                                              \
        : false                                                             \
)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TX_3

#define AO_CAN_TX_3                                                         \
(                                                                           \
        (AO_CAN_FIFOS_TX_3) > 0                                             \
        ? true                                                              \
        : false                                                             \
)

#endif

// ----------------------------------------------------------------------------

#ifndef ao_can_reg_3

#define ao_can_reg_3()                                                      \
(                                                                           \
        (ao_can_reg_t *)                                                    \
        (                                                                   \
            _CAN3_BASE_ADDRESS                                              \
        )                                                                   \
)

#endif

// ----------------------------------------------------------------------------

void    ao_can_listen_all_3();

void    ao_can_listen_only_3();

void    ao_can_loopback_3();

void    ao_can_normal_3();

// ----------------------------------------------------------------------------

void    ao_can_start_3();

void    ao_can_stop_3();

// ----------------------------------------------------------------------------

void    ao_can_bus_3(                   ao_can_bus_t const * x);

void    ao_can_invalid_3();

void    ao_can_mode_3();

void    ao_can_overflow_3(              uint32_t fifos);

void    ao_can_sent_3(                  uint32_t fifos);

void    ao_can_system_3(                ao_can_system_t x);

void    ao_can_timer_3();

void    ao_can_underflow_3(             uint32_t fifos);

void    ao_can_wake_up_3();

// ----------------------------------------------------------------------------

extern  ao_send_obj_t                   ao_can_in_3     [AO_CAN_FIFOS_RX_3];

extern  ao_recv_obj_t                   ao_can_out_3    [AO_CAN_FIFOS_TX_3];

// ----------------------------------------------------------------------------

extern  ao_task_t                       ao_can_task_3;

// ----------------------------------------------------------------------------
